Revit 2027 API
FabricationConfiguration.LoadServices Method
 Loads the specified fabrication services into the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> LoadServices(
	IList<int> serviceIds
)
Public Function LoadServices (
	serviceIds As IList(Of Integer)
) As IList(Of Integer)
public:
IList<int>^ LoadServices(
	IList<int>^ serviceIds
)
member LoadServices :
        serviceIds : IList<int> -> IList<int>
Parameters
serviceIds IList<Int32>
 The identifiers of the fabrication services to load.
Return Value
IList<Int32>
 The identifiers of the fabrication services which failed to load.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The current fabrication configuration is not connected and updated to source configuration. Reload and try again. -or- this operation failed.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace